tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k40_tdd.h
#define RG0PPS1                       1091
#define RG0PPS2                       1092
#define RG0PPS3                       1093
#define RG0PPS4                       1094
#define RG0PPS5                       1095
#define RG1PPS                        1096
#define RG1PPS0                       1097
#define RG1PPS1                       1098
#define RG1PPS2                       1099
#define RG1PPS3                       1100
#define RG1PPS4                       1101
#define RG1PPS5                       1102
#define RG2PPS                        1103
#define RG2PPS0                       1104
#define RG2PPS1                       1105
#define RG2PPS2                       1106
#define RG2PPS3                       1107
#define RG2PPS4                       1108
#define RG2PPS5                       1109
#define RG3PPS                        1110
#define RG3PPS0                       1111
#define RG3PPS1                       1112
#define RG3PPS2                       1113
#define RG3PPS3                       1114
#define RG3PPS4                       1115
#define RG3PPS5                       1116
#define RG4PPS                        1117
#define RG4PPS0                       1118
#define RG4PPS1                       1119
#define RG4PPS2                       1120
#define RG4PPS3                       1121
#define RG4PPS4                       1122
#define RG4PPS5                       1123
#define RG6PPS                        1124
#define RG6PPS0                       1125
#define RG6PPS1                       1126
#define RG6PPS2                       1127
#define RG6PPS3                       1128
#define RG6PPS4                       1129
#define RG6PPS5                       1130
#define RG7PPS                        1131
#define RG7PPS0                       1132
#define RG7PPS1                       1133
#define RG7PPS2                       1134
#define RG7PPS3                       1135
#define RG7PPS4                       1136
#define RG7PPS5                       1137
#define RH0PPS                        1138
#define RH0PPS0                       1139
#define RH0PPS1                       1140
#define RH0PPS2                       1141
#define RH0PPS3                       1142
#define RH0PPS4                       1143
#define RH0PPS5                       1144
#define RH1PPS                        1145
#define RH1PPS0                       1146
#define RH1PPS1                       1147
#define RH1PPS2                       1148
#define RH1PPS3                       1149
#define RH1PPS4                       1150
#define RH1PPS5                       1151
#define RH2PPS                        1152
#define RH2PPS0                       1153
#define RH2PPS1                       1154
#define RH2PPS2                       1155
#define RH2PPS3                       1156
#define RH2PPS4                       1157
#define RH2PPS5                       1158
#define RH3PPS                        1159
#define RH3PPS0                       1160
#define RH3PPS1                       1161
#define RH3PPS2                       1162
#define RH3PPS3                       1163
#define RH3PPS4                       1164
#define RH3PPS5                       1165
#define INLVLA                        1166
#define INLVLA0                       1167
#define INLVLA1                       1168
#define INLVLA2                       1169
#define INLVLA3                       1170
#define INLVLA4                       1171
#define INLVLA5                       1172
#define INLVLA6                       1173
#define INLVLA7                       1174
#define SLRCONA                       1175
#define SLRA0                         1176
#define SLRA1                         1177
#define SLRA2                         1178
#define SLRA3                         1179
#define SLRA4                         1180
#define SLRA5                         1181
#define SLRA6                         1182
#define SLRA7                         1183
#define ODCONA                        1184
#define ODCA0                         1185
#define ODCA1                         1186
#define ODCA2                         1187
#define ODCA3                         1188
#define ODCA4                         1189
#define ODCA5                         1190
#define ODCA6                         1191
#define ODCA7                         1192
#define WPUA                          1193
#define WPUA0                         1194
#define WPUA1                         1195
#define WPUA2                         1196
#define WPUA3                         1197
#define WPUA4                         1198
#define WPUA5                         1199
#define WPUA6                         1200
#define WPUA7                         1201
#define ANSELA                        1202
#define ANSELA0                       1203
#define ANSELA1                       1204
#define ANSELA2                       1205
#define ANSELA3                       1206
#define ANSELA4                       1207
#define ANSELA5                       1208
#define ANSELA6                       1209
#define ANSELA7                       1210
#define IOCBF                         1211
#define IOCBF0                        1212
#define IOCBF1                        1213
#define IOCBF2                        1214
#define IOCBF3                        1215
#define IOCBF4                        1216
#define IOCBF5                        1217
#define IOCBF6                        1218
#define IOCBF7                        1219
#define IOCBN                         1220
#define IOCBN0                        1221
#define IOCBN1                        1222
#define IOCBN2                        1223
#define IOCBN3                        1224
#define IOCBN4                        1225
#define IOCBN5                        1226
#define IOCBN6                        1227
#define IOCBN7                        1228
#define IOCBP                         1229
#define IOCBP0                        1230
#define IOCBP1                        1231
#define IOCBP2                        1232
#define IOCBP3                        1233
#define IOCBP4                        1234
#define IOCBP5                        1235
#define IOCBP6                        1236
#define IOCBP7                        1237
#define INLVLB                        1238
#define INLVLB0                       1239
#define INLVLB1                       1240
#define INLVLB2                       1241
#define INLVLB3                       1242
#define INLVLB4                       1243
#define INLVLB5                       1244
#define INLVLB6                       1245
#define INLVLB7                       1246
#define SLRCONB                       1247
#define SLRB0                         1248
#define SLRB1                         1249
#define SLRB2                         1250
#define SLRB3                         1251
#define SLRB4                         1252
#define SLRB5                         1253
#define SLRB6                         1254
#define SLRB7                         1255
#define ODCONB                        1256
#define ODCB0                         1257
#define ODCB1                         1258
#define ODCB2                         1259
#define ODCB3                         1260
#define ODCB4                         1261
#define ODCB5                         1262
#define ODCB6                         1263
#define ODCB7                         1264
#define WPUB                          1265
#define WPUB0                         1266
#define WPUB1                         1267
#define WPUB2                         1268
#define WPUB3                         1269
#define WPUB4                         1270
#define WPUB5                         1271
#define WPUB6                         1272
#define WPUB7                         1273
#define ANSELB                        1274
#define ANSELB0                       1275
#define ANSELB1                       1276
#define ANSELB2                       1277
#define ANSELB3                       1278
#define ANSELB4                       1279
#define ANSELB5                       1280
#define ANSELB6                       1281
#define ANSELB7                       1282
#define IOCCF                         1283
#define IOCCF0                        1284
#define IOCCF1                        1285
#define IOCCF2                        1286
#define IOCCF3                        1287
#define IOCCF4                        1288
#define IOCCF5                        1289
#define IOCCF6                        1290
#define IOCCF7                        1291
#define IOCCN                         1292
#define IOCCN0                        1293
#define IOCCN1                        1294
#define IOCCN2                        1295
#define IOCCN3                        1296
#define IOCCN4                        1297
#define IOCCN5                        1298
#define IOCCN6                        1299
#define IOCCN7                        1300
#define IOCCP                         1301
#define IOCCP0                        1302
#define IOCCP1                        1303
#define IOCCP2                        1304
#define IOCCP3                        1305
#define IOCCP4                        1306
#define IOCCP5                        1307
#define IOCCP6                        1308
#define IOCCP7                        1309
#define INLVLC                        1310
#define INLVLC0                       1311
#define INLVLC1                       1312
#define INLVLC2                       1313
#define INLVLC3                       1314
#define INLVLC4                       1315
#define INLVLC5                       1316
#define INLVLC6                       1317
#define INLVLC7                       1318
#define SLRCONC                       1319
#define SLRC0                         1320
#define SLRC1                         1321
#define SLRC2                         1322
#define SLRC3                         1323
#define SLRC4                         1324
#define SLRC5                         1325
#define SLRC6                         1326
#define SLRC7                         1327
#define ODCONC                        1328
#define ODCC0                         1329
#define ODCC1                         1330
#define ODCC2                         1331
#define ODCC3                         1332
#define ODCC4                         1333
#define ODCC5                         1334
#define ODCC6                         1335
#define ODCC7                         1336
#define WPUC                          1337
#define WPUC0                         1338
#define WPUC1                         1339
#define WPUC2                         1340
#define WPUC3                         1341
#define WPUC4                         1342
#define WPUC5                         1343
#define WPUC6                         1344
#define WPUC7                         1345
#define INLVLD                        1346
#define INLVLD0                       1347
#define INLVLD1                       1348
#define INLVLD2                       1349
#define INLVLD3                       1350
#define INLVLD4                       1351
#define INLVLD5                       1352
#define INLVLD6                       1353
#define INLVLD7                       1354
#define SLRCOND                       1355
#define SLRD0                         1356
#define SLRD1                         1357
#define SLRD2                         1358
#define SLRD3                         1359
#define SLRD4                         1360
#define SLRD5                         1361
#define SLRD6                         1362
#define SLRD7                         1363
#define ODCOND                        1364
#define ODCD0                         1365
#define ODCD1                         1366
#define ODCD2                         1367
#define ODCD3                         1368
#define ODCD4                         1369
#define ODCD5                         1370
#define ODCD6                         1371
#define ODCD7                         1372
#define WPUD                          1373
#define WPUD0                         1374
#define WPUD1                         1375
#define WPUD2                         1376
#define WPUD3                         1377
#define WPUD4                         1378
#define WPUD5                         1379
#define WPUD6                         1380
#define WPUD7                         1381
#define ANSELD                        1382
#define ANSELD0                       1383
#define ANSELD1                       1384
#define ANSELD2                       1385
#define ANSELD3                       1386
#define ANSELD4                       1387
#define ANSELD5                       1388
#define ANSELD6                       1389
#define ANSELD7                       1390
#define IOCEF                         1391
#define IOCEF0                        1392
#define IOCEF1                        1393
#define IOCEF2                        1394
#define IOCEF3                        1395
#define IOCEF4                        1396
#define IOCEF5                        1397
#define IOCEF6                        1398
#define IOCEF7                        1399
#define IOCEN                         1400
#define IOCEN0                        1401
#define IOCEN1                        1402
#define IOCEN2                        1403
#define IOCEN3                        1404
#define IOCEN4                        1405
#define IOCEN5                        1406
#define IOCEN6                        1407
#define IOCEN7                        1408
#define IOCEP                         1409
#define IOCEP0                        1410
#define IOCEP1                        1411
#define IOCEP2                        1412
#define IOCEP3                        1413
#define IOCEP4                        1414
#define IOCEP5                        1415
#define IOCEP6                        1416
#define IOCEP7                        1417
#define INLVLE                        1418
#define INLVLE0                       1419
#define INLVLE1                       1420
#define INLVLE2                       1421
#define INLVLE3                       1422
#define INLVLE4                       1423
#define INLVLE5                       1424
#define INLVLE6                       1425
#define INLVLE7                       1426
#define SLRCONE                       1427
#define SLRE0                         1428
#define SLRE1                         1429
#define SLRE2                         1430
#define SLRE3                         1431
#define SLRE4                         1432
#define SLRE5                         1433
#define SLRE6                         1434
#define SLRE7                         1435
#define ODCONE                        1436
#define ODCE0                         1437
#define ODCE1                         1438
#define ODCE2                         1439
#define ODCE3                         1440
#define ODCE4                         1441
#define ODCE5                         1442
#define ODCE6                         1443
#define ODCE7                         1444
#define WPUE                          1445
#define WPUE0                         1446
#define WPUE1                         1447
#define WPUE2                         1448
#define WPUE3                         1449
#define WPUE4                         1450
#define WPUE5                         1451
#define WPUE6                         1452
#define WPUE7                         1453
#define ANSELE                        1454
#define ANSELE0                       1455
#define ANSELE1                       1456
#define ANSELE2                       1457
#define ANSELE3                       1458
#define ANSELE4                       1459
#define ANSELE5                       1460
#define ANSELE6                       1461
#define ANSELE7                       1462
#define INLVLF                        1463
#define INLVLF0                       1464
#define INLVLF1                       1465
#define INLVLF2                       1466
#define INLVLF3                       1467
#define INLVLF4                       1468
#define INLVLF5                       1469
#define INLVLF6                       1470
#define INLVLF7                       1471
#define SLRCONF                       1472
#define SLRF0                         1473
#define SLRF1                         1474
#define SLRF2                         1475
#define SLRF3                         1476
#define SLRF4                         1477
#define SLRF5                         1478
#define SLRF6                         1479
#define SLRF7                         1480
#define ODCONF                        1481
#define ODCF0                         1482
#define ODCF1                         1483
#define ODCF2                         1484
#define ODCF3                         1485
#define ODCF4                         1486
#define ODCF5                         1487
#define ODCF6                         1488
#define ODCF7                         1489
#define WPUF                          1490
#define WPUF0                         1491
#define WPUF1                         1492
#define WPUF2                         1493
#define WPUF3                         1494
#define WPUF4                         1495
#define WPUF5                         1496
#define WPUF6                         1497
#define WPUF7                         1498
#define ANSELF                        1499
#define ANSELF0                       1500
#define ANSELF1                       1501
#define ANSELF2                       1502
#define ANSELF3                       1503
#define ANSELF4                       1504
#define ANSELF5                       1505
#define ANSELF6                       1506
#define ANSELF7                       1507
#define IOCGF                         1508
#define IOCGF0                        1509
#define IOCGF1                        1510
#define IOCGF2                        1511
#define IOCGF3                        1512
#define IOCGF4                        1513
#define IOCGF5                        1514
#define IOCGF6                        1515
#define IOCGF7                        1516
#define IOCGN                         1517
#define IOCGN0                        1518
#define IOCGN1                        1519
#define IOCGN2                        1520
#define IOCGN3                        1521
#define IOCGN4                        1522
#define IOCGN5                        1523
#define IOCGN6                        1524
#define IOCGN7                        1525
#define IOCGP                         1526
#define IOCGP0                        1527
#define IOCGP1                        1528
#define IOCGP2                        1529
#define IOCGP3                        1530
#define IOCGP4                        1531
#define IOCGP5                        1532
#define IOCGP6                        1533
#define IOCGP7                        1534
#define INLVLG                        1535
#define INLVLG0                       1536
#define INLVLG1                       1537
#define INLVLG2                       1538
#define INLVLG3                       1539
#define INLVLG4                       1540
#define INLVLG5                       1541
#define INLVLG6                       1542
#define INLVLG7                       1543
#define SLRCONG                       1544
#define SLRG0                         1545
#define SLRG1                         1546
#define SLRG2                         1547
#define SLRG3                         1548
#define SLRG4                         1549
#define SLRG5                         1550
#define SLRG6                         1551
#define SLRG7                         1552
#define ODCONG                        1553
#define ODCG0                         1554
#define ODCG1                         1555
#define ODCG2                         1556
#define ODCG3                         1557
#define ODCG4                         1558
#define ODCG5                         1559
#define ODCG6                         1560
#define ODCG7                         1561
#define WPUG                          1562
#define WPUG0                         1563
#define WPUG1                         1564
#define WPUG2                         1565
#define WPUG3                         1566
#define WPUG4                         1567
#define WPUG5                         1568
#define WPUG6                         1569
#define WPUG7                         1570
#define ANSELG                        1571
#define ANSELG0                       1572
#define ANSELG1                       1573
#define ANSELG2                       1574
#define ANSELG3                       1575
#define ANSELG4                       1576
#define ANSELG5                       1577
#define ANSELG6                       1578
#define ANSELG7                       1579
#define INLVLH                        1580
#define INLVLH0                       1581
#define INLVLH1                       1582
#define INLVLH2                       1583
#define INLVLH3                       1584
#define INLVLH4                       1585
#define INLVLH5                       1586
#define INLVLH6                       1587
#define INLVLH7                       1588
#define SLRCONH                       1589
#define SLRH0                         1590
#define SLRH1                         1591
#define SLRH2                         1592
#define SLRH3                         1593
#define SLRH4                         1594
#define SLRH5                         1595
#define SLRH6                         1596
#define SLRH7                         1597
#define ODCONH                        1598
#define ODCH0                         1599
#define ODCH1                         1600
#define ODCH2                         1601
#define ODCH3                         1602
#define ODCH4                         1603
#define ODCH5                         1604
#define ODCH6                         1605
#define ODCH7                         1606
#define WPUH                          1607
#define WPUH0                         1608
#define WPUH1                         1609
#define WPUH2                         1610
#define WPUH3                         1611
#define WPUH4                         1612
#define WPUH5                         1613
#define WPUH6                         1614
#define WPUH7                         1615
#define HLVDCON0                      1616
#define INTL                          1617
#define HLVDINTL                      1618
#define INTH                          1619
#define HLVDINTH                      1620
#define RDY                           1621
#define HLVDRDY                       1622
#define HLVDCON0_OUT                  1623
#define HLVDOUT                       1624
#define HLVDEN                        1625
#define HLVDCON0_EN                   1626
#define HLVDCON1                      1627
#define HLVDSEL0                      1628
#define SEL                           1629
#define SEL0                          1630
#define HLVDSEL1                      1631
#define SEL1                          1632
#define HLVDSEL2                      1633
#define SEL2                          1634
#define HLVDSEL3                      1635
#define SEL3                          1636
#define FVRCON                        1637
#define ADFVR0                        1638
#define ADFVR                         1639
#define ADFVR1                        1640
#define CDAFVR                        1641
#define CDAFVR0                       1642
#define CDAFVR1                       1643
#define TSRNG                         1644
#define TSEN                          1645
#define FVRRDY                        1646
#define FVREN                         1647
#define ZCDCON                        1648
