tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k40_tdd.h
#define ZCDINTN                       1649
#define ZCDINTP                       1650
#define ZCDPOL                        1651
#define ZCDOUT                        1652
#define ZCDSEN                        1653
#define DAC1CON0                      1654
#define NSS                           1655
#define DAC1NSS                       1656
#define DAC1PSS0                      1657
#define PSS                           1658
#define PSS0                          1659
#define PSS1                          1660
#define DAC1PSS1                      1661
#define OE2                           1662
#define DAC1OE2                       1663
#define OE1                           1664
#define DAC1OE1                       1665
#define DAC1CON0_EN                   1666
#define DAC1EN                        1667
#define DAC1CON1                      1668
#define DAC1R                         1669
#define DAC1R0                        1670
#define DAC1R1                        1671
#define DAC1R2                        1672
#define DAC1R3                        1673
#define DAC1R4                        1674
#define CM3CON0                       1675
#define C3SYNC                        1676
#define CM3CON0_SYNC                  1677
#define CM3CON0_HYS                   1678
#define C3HYS                         1679
#define CM3CON0_POL                   1680
#define C3POL                         1681
#define C3OUT                         1682
#define CM3CON0_OUT                   1683
#define CM3CON0_EN                    1684
#define C3EN                          1685
#define CM3CON1                       1686
#define CM3CON1_INTN                  1687
#define C3INTN                        1688
#define CM3CON1_INTP                  1689
#define C3INTP                        1690
#define CM3NCH                        1691
#define CM3NCH_NCH                    1692
#define C3NCH0                        1693
#define CM3NCH_NCH0                   1694
#define C3NCH1                        1695
#define CM3NCH_NCH1                   1696
#define C3NCH2                        1697
#define CM3NCH_NCH2                   1698
#define CM3PCH                        1699
#define CM3PCH_PCH                    1700
#define CM3PCH_PCH0                   1701
#define C3PCH0                        1702
#define CM3PCH_PCH1                   1703
#define C3PCH1                        1704
#define CM3PCH_PCH2                   1705
#define C3PCH2                        1706
#define CM2CON0                       1707
#define CM2CON0_SYNC                  1708
#define C2SYNC                        1709
#define C2HYS                         1710
#define CM2CON0_HYS                   1711
#define C2POL                         1712
#define CM2CON0_POL                   1713
#define CM2CON0_OUT                   1714
#define C2OUT                         1715
#define C2EN                          1716
#define CM2CON0_EN                    1717
#define CM2CON1                       1718
#define C2INTN                        1719
#define CM2CON1_INTN                  1720
#define CM2CON1_INTP                  1721
#define C2INTP                        1722
#define CM2NCH                        1723
#define C2NCH0                        1724
#define CM2NCH_NCH0                   1725
#define CM2NCH_NCH                    1726
#define C2NCH1                        1727
#define CM2NCH_NCH1                   1728
#define C2NCH2                        1729
#define CM2NCH_NCH2                   1730
#define CM2PCH                        1731
#define CM2PCH_PCH                    1732
#define C2PCH0                        1733
#define CM2PCH_PCH0                   1734
#define C2PCH1                        1735
#define CM2PCH_PCH1                   1736
#define C2PCH2                        1737
#define CM2PCH_PCH2                   1738
#define CM1CON0                       1739
#define CM1CON0_SYNC                  1740
#define C1SYNC                        1741
#define CM1CON0_HYS                   1742
#define C1HYS                         1743
#define CM1CON0_POL                   1744
#define C1POL                         1745
#define C1OUT                         1746
#define CM1CON0_OUT                   1747
#define CM1CON0_EN                    1748
#define C1EN                          1749
#define CM1CON1                       1750
#define C1INTN                        1751
#define CM1CON1_INTN                  1752
#define CM1CON1_INTP                  1753
#define C1INTP                        1754
#define CM1NCH                        1755
#define C1NCH0                        1756
#define CM1NCH_NCH0                   1757
#define CM1NCH_NCH                    1758
#define C1NCH1                        1759
#define CM1NCH_NCH1                   1760
#define C1NCH2                        1761
#define CM1NCH_NCH2                   1762
#define CM1PCH                        1763
#define CM1PCH_PCH0                   1764
#define C1PCH0                        1765
#define CM1PCH_PCH                    1766
#define CM1PCH_PCH1                   1767
#define C1PCH1                        1768
#define CM1PCH_PCH2                   1769
#define C1PCH2                        1770
#define CMOUT                         1771
#define MC1OUT                        1772
#define MC2OUT                        1773
#define MC3OUT                        1774
#define SSP2BUF                       1775
#define SSP2BUF_SSPBUF                1776
#define SSP2ADD                       1777
#define MSK02                         1778
#define SSP2ADD_SSPADD                1779
#define MSK12                         1780
#define MSK22                         1781
#define MSK32                         1782
#define MSK42                         1783
#define MSK52                         1784
#define MSK62                         1785
#define MSK72                         1786
#define SSP2MSK                       1787
#define SSP2MSK_SSPMSK                1788
#define SSP2MSK_MSK0                  1789
#define SSP2MSK_MSK1                  1790
#define SSP2MSK_MSK2                  1791
#define SSP2MSK_MSK3                  1792
#define SSP2MSK_MSK4                  1793
#define SSP2MSK_MSK5                  1794
#define SSP2MSK_MSK6                  1795
#define SSP2MSK_MSK7                  1796
#define SSP2STAT                      1797
#define SSP2STAT_BF                   1798
#define BF2                           1799
#define SSP2STAT_UA                   1800
#define UA2                           1801
#define SSP2STAT_R_W                  1802
#define RW2                           1803
#define SSP2STAT_nWRITE               1804
#define SSP2STAT_nW                   1805
#define READ_WRITE2                   1806
#define nW2                           1807
#define SSP2STAT_I2C_READ             1808
#define I2C_READ2                     1809
#define SSP2STAT_R_NOT_W              1810
#define R_nW2                         1811
#define SSP2STAT_READ_WRITE           1812
#define nWRITE2                       1813
#define R_W2                          1814
#define SSP2STAT_R_nW                 1815
#define SSP2STAT_NOT_WRITE            1816
#define SSP2STAT_S                    1817
#define S2                            1818
#define START2                        1819
#define SSP2STAT_I2C_START            1820
#define I2C_START2                    1821
#define P2                            1822
#define SSP2STAT_I2C_STOP             1823
#define STOP2                         1824
#define SSP2STAT_P                    1825
#define I2C_STOP2                     1826
#define I2C_DAT2                      1827
#define DATA_ADDRESS2                 1828
#define SSP2STAT_D_NOT_A              1829
#define SSP2STAT_I2C_DAT              1830
#define D_A2                          1831
#define SSP2STAT_NOT_ADDRESS          1832
#define SSP2STAT_D_nA                 1833
#define SSP2STAT_DATA_ADDRESS         1834
#define SSP2STAT_nADDRESS             1835
#define nA2                           1836
#define DA2                           1837
#define nADDRESS2                     1838
#define SSP2STAT_nA                   1839
#define SSP2STAT_D_A                  1840
#define D_nA2                         1841
#define SSP2STAT_CKE                  1842
#define CKE2                          1843
#define SSP2STAT_SMP                  1844
#define SMP2                          1845
#define SSP2CON1                      1846
#define SSP2CON1_SSPM                 1847
#define SSP2CON1_SSPM0                1848
#define SSPM02                        1849
#define SSPM12                        1850
#define SSP2CON1_SSPM1                1851
#define SSP2CON1_SSPM2                1852
#define SSPM22                        1853
#define SSPM32                        1854
#define SSP2CON1_SSPM3                1855
#define SSP2CON1_CKP                  1856
#define CKP2                          1857
#define SSPEN2                        1858
#define SSP2CON1_SSPEN                1859
#define SSPOV2                        1860
#define SSP2CON1_SSPOV                1861
#define WCOL2                         1862
#define SSP2CON1_WCOL                 1863
#define SSP2CON2                      1864
#define SEN2                          1865
#define SSP2CON2_SEN                  1866
#define ADMSK12                       1867
#define SSP2CON2_ADMSK                1868
#define SSP2CON2_RSEN                 1869
#define RSEN2                         1870
#define SSP2CON2_ADMSK1               1871
#define ADMSK22                       1872
#define PEN2                          1873
#define SSP2CON2_PEN                  1874
#define SSP2CON2_ADMSK2               1875
#define ADMSK32                       1876
#define SSP2CON2_RCEN                 1877
#define RCEN2                         1878
#define SSP2CON2_ADMSK3               1879
#define ACKEN2                        1880
#define ADMSK42                       1881
#define SSP2CON2_ADMSK4               1882
#define SSP2CON2_ACKEN                1883
#define ACKDT2                        1884
#define ADMSK52                       1885
#define SSP2CON2_ACKDT                1886
#define SSP2CON2_ADMSK5               1887
#define SSP2CON2_ACKSTAT              1888
#define ACKSTAT2                      1889
#define SSP2CON2_GCEN                 1890
#define GCEN2                         1891
#define SSP2CON3                      1892
#define SSP2CON3_DHEN                 1893
#define SSP2CON3_AHEN                 1894
#define SSP2CON3_SBCDE                1895
#define SSP2CON3_SDAHT                1896
#define SSP2CON3_BOEN                 1897
#define SSP2CON3_SCIE                 1898
#define SSP2CON3_PCIE                 1899
#define SSP2CON3_ACKTIM               1900
#define RC5REG                        1901
#define TX5REG                        1902
#define SP5BRGL                       1903
#define SP5BRGH                       1904
#define RC5STA                        1905
#define RC5STA_RX9D                   1906
#define RC5STA_OERR                   1907
#define RC5STA_FERR                   1908
#define RC5STA_ADDEN                  1909
#define RC5STA_CREN                   1910
#define RC5STA_SREN                   1911
#define RC5STA_RX9                    1912
#define RC5STA_SPEN                   1913
#define TX5STA                        1914
#define TX5STA_TX9D                   1915
#define TX5STA_TRMT                   1916
#define TX5STA_BRGH                   1917
#define TX5STA_SENDB                  1918
#define TX5STA_SYNC                   1919
#define TX5STA_TXEN                   1920
#define TX5STA_TX9                    1921
#define TX5STA_CSRC                   1922
#define BAUD5CON                      1923
#define BAUD5CON_ABDEN                1924
#define BAUD5CON_WUE                  1925
#define BAUD5CON_BRG16                1926
#define BAUD5CON_SCKP                 1927
#define BAUD5CON_RCIDL                1928
#define BAUD5CON_ABDOVF               1929
#define RC4REG                        1930
#define TX4REG                        1931
#define SP4BRGL                       1932
#define SP4BRGH                       1933
#define RC4STA                        1934
#define RC4STA_RX9D                   1935
#define RC4STA_OERR                   1936
#define RC4STA_FERR                   1937
#define RC4STA_ADDEN                  1938
#define RC4STA_CREN                   1939
#define RC4STA_SREN                   1940
#define RC4STA_RX9                    1941
#define RC4STA_SPEN                   1942
#define TX4STA                        1943
#define TX4STA_TX9D                   1944
#define TX4STA_TRMT                   1945
#define TX4STA_BRGH                   1946
#define TX4STA_SENDB                  1947
#define TX4STA_SYNC                   1948
#define TX4STA_TXEN                   1949
#define TX4STA_TX9                    1950
#define TX4STA_CSRC                   1951
#define BAUD4CON                      1952
#define BAUD4CON_ABDEN                1953
#define BAUD4CON_WUE                  1954
#define BAUD4CON_BRG16                1955
#define BAUD4CON_SCKP                 1956
#define BAUD4CON_RCIDL                1957
#define BAUD4CON_ABDOVF               1958
#define RC3REG                        1959
#define TX3REG                        1960
#define SP3BRGL                       1961
#define SP3BRGH                       1962
#define RC3STA                        1963
#define RC3STA_RX9D                   1964
#define RC3STA_OERR                   1965
#define RC3STA_FERR                   1966
#define RC3STA_ADDEN                  1967
#define RC3STA_CREN                   1968
#define RC3STA_SREN                   1969
#define RC3STA_RX9                    1970
#define RC3STA_SPEN                   1971
#define TX3STA                        1972
#define TX3STA_TX9D                   1973
#define TX3STA_TRMT                   1974
#define TX3STA_BRGH                   1975
#define TX3STA_SENDB                  1976
#define TX3STA_SYNC                   1977
#define TX3STA_TXEN                   1978
#define TX3STA_TX9                    1979
#define TX3STA_CSRC                   1980
#define BAUD3CON                      1981
#define BAUD3CON_ABDEN                1982
#define BAUD3CON_WUE                  1983
#define BAUD3CON_BRG16                1984
#define BAUD3CON_SCKP                 1985
#define BAUD3CON_RCIDL                1986
#define BAUD3CON_ABDOVF               1987
#define RC2REG                        1988
#define TX2REG                        1989
#define SP2BRGL                       1990
#define SP2BRGH                       1991
#define RC2STA                        1992
#define RC2STA_RX9D                   1993
#define RCD82                         1994
#define RC2STA_OERR                   1995
#define RC2STA_FERR                   1996
#define RC2STA_ADDEN                  1997
#define RC2STA_CREN                   1998
#define RC2STA_SREN                   1999
#define RC92                          2000
#define RC2STA_RX9                    2001
#define RC8_92                        2002
#define RC2STA_SPEN                   2003
#define TX2STA                        2004
#define TX2STA_TX9D                   2005
#define TXD82                         2006
#define TX2STA_TRMT                   2007
#define TX2STA_BRGH                   2008
#define TX2STA_SENDB                  2009
#define TX2STA_SYNC                   2010
#define TX2STA_TXEN                   2011
#define TX8_92                        2012
#define TX2STA_TX9                    2013
#define TX2STA_CSRC                   2014
#define BAUD2CON                      2015
#define BAUD2CON_ABDEN                2016
#define ABDEN2                        2017
#define WUE2                          2018
#define BAUD2CON_WUE                  2019
#define BRG162                        2020
#define BAUD2CON_BRG16                2021
#define SCKP2                         2022
#define BAUD2CON_SCKP                 2023
#define TXCKP2                        2024
#define BAUD2CON_RCIDL                2025
#define RCMT2                         2026
#define RCIDL2                        2027
#define BAUD2CON_ABDOVF               2028
#define ABDOVF2                       2029
#define SMT2TMRL                      2030
#define SMT2TMRL_SMT2TMR              2031
#define SMT2TMR0                      2032
#define SMT2TMR1                      2033
#define SMT2TMR2                      2034
#define SMT2TMR3                      2035
#define SMT2TMR4                      2036
#define SMT2TMR5                      2037
#define SMT2TMR6                      2038
#define SMT2TMR7                      2039
#define SMT2TMRH                      2040
#define SMT2TMR8                      2041
#define SMT2TMRH_SMT2TMR              2042
#define SMT2TMR9                      2043
#define SMT2TMR10                     2044
#define SMT2TMR11                     2045
#define SMT2TMR12                     2046
#define SMT2TMR13                     2047
#define SMT2TMR14                     2048
#define SMT2TMR15                     2049
#define SMT2TMRU                      2050
#define SMT2TMR16                     2051
#define SMT2TMRU_SMT2TMR              2052
#define SMT2TMR17                     2053
#define SMT2TMR18                     2054
#define SMT2TMR19                     2055
#define SMT2TMR20                     2056
#define SMT2TMR21                     2057
#define SMT2TMR22                     2058
#define SMT2TMR23                     2059
#define SMT2CPRL                      2060
#define SMT2CPRL_SMT2CPR              2061
#define SMT2CPR0                      2062
#define SMT2CPR1                      2063
#define SMT2CPR2                      2064
#define SMT2CPR3                      2065
#define SMT2CPR4                      2066
#define SMT2CPR5                      2067
#define SMT2CPR6                      2068
#define SMT2CPR7                      2069
#define SMT2CPRH                      2070
#define SMT2CPR8                      2071
#define SMT2CPRH_SMT2CPR              2072
#define SMT2CPR9                      2073
#define SMT2CPR10                     2074
#define SMT2CPR11                     2075
#define SMT2CPR12                     2076
#define SMT2CPR13                     2077
#define SMT2CPR14                     2078
#define SMT2CPR15                     2079
#define SMT2CPRU                      2080
#define SMT2CPRU_SMT2CPR              2081
#define SMT2CPR16                     2082
#define SMT2CPR17                     2083
#define SMT2CPR18                     2084
#define SMT2CPR19                     2085
#define SMT2CPR20                     2086
#define SMT2CPR21                     2087
#define SMT2CPR22                     2088
#define SMT2CPR23                     2089
#define SMT2CPWL                      2090
#define SMT2CPWL_SMT2CPW              2091
#define SMT2CPW0                      2092
#define SMT2CPW1                      2093
#define SMT2CPW2                      2094
#define SMT2CPW3                      2095
#define SMT2CPW4                      2096
#define SMT2CPW5                      2097
#define SMT2CPW6                      2098
#define SMT2CPW7                      2099
#define SMT2CPWH                      2100
#define SMT2CPWH_SMT2CPW              2101
#define SMT2CPW8                      2102
#define SMT2CPW9                      2103
#define SMT2CPW10                     2104
#define SMT2CPW11                     2105
#define SMT2CPW12                     2106
#define SMT2CPW13                     2107
#define SMT2CPW14                     2108
#define SMT2CPW15                     2109
#define SMT2CPWU                      2110
#define SMT2CPWU_SMT2CPW              2111
#define SMT2CPW16                     2112
#define SMT2CPW17                     2113
#define SMT2CPW18                     2114
#define SMT2CPW19                     2115
#define SMT2CPW20                     2116
#define SMT2CPW21                     2117
#define SMT2CPW22                     2118
#define SMT2CPW23                     2119
#define SMT2PRL                       2120
#define SMT2PRL_SMT2PR                2121
#define SMT2PR0                       2122
#define SMT2PR1                       2123
#define SMT2PR2                       2124
#define SMT2PR3                       2125
#define SMT2PR4                       2126
#define SMT2PR5                       2127
#define SMT2PR6                       2128
#define SMT2PR7                       2129
#define SMT2PRH                       2130
#define SMT2PRH_SMT2PR                2131
#define SMT2PR8                       2132
#define SMT2PR9                       2133
#define SMT2PR10                      2134
#define SMT2PR11                      2135
#define SMT2PR12                      2136
#define SMT2PR13                      2137
#define SMT2PR14                      2138
#define SMT2PR15                      2139
#define SMT2PRU                       2140
#define SMT2PRU_SMT2PR                2141
#define SMT2PR16                      2142
#define SMT2PR17                      2143
#define SMT2PR18                      2144
#define SMT2PR19                      2145
#define SMT2PR20                      2146
#define SMT2PR21                      2147
#define SMT2PR22                      2148
#define SMT2PR23                      2149
#define SMT2CON0                      2150
#define SMT2PS0                       2151
#define SMT2PS                        2152
#define SMT2PS1                       2153
#define SMT2CON0_CPOL                 2154
#define SMT2CON0_SPOL                 2155
#define SMT2CON0_WPOL                 2156
#define SMT2CON0_STP                  2157
#define SMT2CON0_EN                   2158
#define SMT2CON1                      2159
#define SMT2CON1_MODE                 2160
#define SMT2CON1_MODE0                2161
#define SMT2MODE0                     2162
#define SMT2MODE                      2163
#define SMT2CON1_MODE1                2164
#define SMT2MODE1                     2165
#define SMT2CON1_MODE2                2166
#define SMT2MODE2                     2167
#define SMT2CON1_MODE3                2168
#define SMT2MODE3                     2169
#define SMT2REPEAT                    2170
#define SMT2CON1_REPEAT               2171
#define SMT2GO                        2172
#define SMT2STAT                      2173
#define SMT2AS                        2174
#define SMT2STAT_AS                   2175
#define SMT2WS                        2176
#define SMT2STAT_WS                   2177
#define SMT2STAT_TS                   2178
#define SMT2TS                        2179
#define SMT2RESET                     2180
#define SMT2STAT_RST                  2181
#define SMT2CPWUP                     2182
#define SMT2STAT_CPWUP                2183
#define SMT2STAT_CPRUP                2184
#define SMT2CPRUP                     2185
#define SMT2CLK                       2186
#define SMT2CLK_CSEL                  2187
#define SMT2CSEL0                     2188
#define SMT2CLK_CSEL0                 2189
#define SMT2CSEL                      2190
#define SMT2CSEL1                     2191
#define SMT2CLK_CSEL1                 2192
#define SMT2CSEL2                     2193
#define SMT2CLK_CSEL2                 2194
#define SMT2CSEL3                     2195
#define SMT2CLK_CSEL3                 2196
#define SMT2CSEL4                     2197
#define SMT2CLK_CSEL4                 2198
#define SMT2CSEL5                     2199
#define SMT2CLK_CSEL5                 2200
#define SMT2CSEL6                     2201
#define SMT2CLK_CSEL6                 2202
#define SMT2CSEL7                     2203
#define SMT2CLK_CSEL7                 2204
#define SMT2SIG                       2205
#define SMT2SIG_SSEL                  2206
