tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k40_tdd.h
#define CWG1DBR1                      2765
#define DBR1                          2766
#define CWG1DBR2                      2767
#define DBR2                          2768
#define CWG1DBR3                      2769
#define DBR3                          2770
#define CWG1DBR4                      2771
#define DBR4                          2772
#define CWG1DBR5                      2773
#define DBR5                          2774
#define CWG1DBF                       2775
#define CWG1DBF0                      2776
#define DBF                           2777
#define DBF0                          2778
#define CWG1DBF1                      2779
#define DBF1                          2780
#define CWG1DBF2                      2781
#define DBF2                          2782
#define CWG1DBF3                      2783
#define DBF3                          2784
#define CWG1DBF4                      2785
#define DBF4                          2786
#define DBF5                          2787
#define CWG1DBF5                      2788
#define CWG1CON0                      2789
#define CWG1MODE0                     2790
#define CWG1CON0_MODE                 2791
#define CWG1CON0_MODE0                2792
#define CWG1MODE                      2793
#define CWG1MODE1                     2794
#define CWG1CON0_MODE1                2795
#define CWG1MODE2                     2796
#define CWG1CON0_MODE2                2797
#define LD                            2798
#define CWG1LD                        2799
#define CWG1EN                        2800
#define G1EN                          2801
#define CWG1CON0_EN                   2802
#define CWG1CON1                      2803
#define CWG1POLA                      2804
#define POLA                          2805
#define CWG1POLB                      2806
#define POLB                          2807
#define CWG1POLC                      2808
#define POLC                          2809
#define CWG1POLD                      2810
#define POLD                          2811
#define IN                            2812
#define CWG1IN                        2813
#define CWG1AS0                       2814
#define CWG1LSAC                      2815
#define LSAC                          2816
#define LSAC0                         2817
#define CWG1LSAC0                     2818
#define LSAC1                         2819
#define CWG1LSAC1                     2820
#define LSBD0                         2821
#define CWG1LSBD0                     2822
#define LSBD                          2823
#define CWG1LSBD                      2824
#define LSBD1                         2825
#define CWG1LSBD1                     2826
#define CWG1REN                       2827
#define REN                           2828
#define CWG1SHUTDOWN                  2829
#define SHUTDOWN                      2830
#define CWG1AS1                       2831
#define AS0E                          2832
#define AS1E                          2833
#define AS2E                          2834
#define AS3E                          2835
#define AS4E                          2836
#define AS5E                          2837
#define AS6E                          2838
#define AS7E                          2839
#define CWG1STR                       2840
#define CWG1STRA                      2841
#define STRA                          2842
#define STRB                          2843
#define CWG1STRB                      2844
#define CWG1STRC                      2845
#define STRC                          2846
#define CWG1STRD                      2847
#define STRD                          2848
#define OVRA                          2849
#define CWG1OVRA                      2850
#define CWG1OVRB                      2851
#define OVRB                          2852
#define OVRC                          2853
#define CWG1OVRC                      2854
#define OVRD                          2855
#define CWG1OVRD                      2856
#define CRCDATL                       2857
#define DATA0                         2858
#define DATA1                         2859
#define DATA2                         2860
#define DATA3                         2861
#define DATA4                         2862
#define DATA5                         2863
#define DATA6                         2864
#define DATA7                         2865
#define CRCDATH                       2866
#define DATA8                         2867
#define DATA9                         2868
#define DATA10                        2869
#define DATA11                        2870
#define DATA12                        2871
#define DATA13                        2872
#define DATA14                        2873
#define DATA15                        2874
#define CRCACCL                       2875
#define ACC0                          2876
#define ACC1                          2877
#define ACC2                          2878
#define ACC3                          2879
#define ACC4                          2880
#define ACC5                          2881
#define ACC6                          2882
#define ACC7                          2883
#define CRCACCH                       2884
#define ACC8                          2885
#define ACC9                          2886
#define ACC10                         2887
#define ACC11                         2888
#define ACC12                         2889
#define ACC13                         2890
#define ACC14                         2891
#define ACC15                         2892
#define CRCSHIFTL                     2893
#define SHFT0                         2894
#define SHFT1                         2895
#define SHFT2                         2896
#define SHFT3                         2897
#define SHFT4                         2898
#define SHFT5                         2899
#define SHFT6                         2900
#define SHFT7                         2901
#define CRCSHIFTH                     2902
#define SHFT8                         2903
#define SHFT9                         2904
#define SHFT10                        2905
#define SHFT11                        2906
#define SHFT12                        2907
#define SHFT13                        2908
#define SHFT14                        2909
#define SHFT15                        2910
#define CRCXORL                       2911
#define X1                            2912
#define X2                            2913
#define X3                            2914
#define X4                            2915
#define X5                            2916
#define X6                            2917
#define X7                            2918
#define CRCXORH                       2919
#define X8                            2920
#define X9                            2921
#define X10                           2922
#define X11                           2923
#define X12                           2924
#define X13                           2925
#define X14                           2926
#define X15                           2927
#define CRCCON0                       2928
#define FULL                          2929
#define SHIFTM                        2930
#define ACCM                          2931
#define CRCCON0_BUSY                  2932
#define CRCGO                         2933
#define CRCCON0_EN                    2934
#define CRCEN                         2935
#define CRCCON1                       2936
#define PLEN0                         2937
#define PLEN                          2938
#define PLEN1                         2939
#define PLEN2                         2940
#define PLEN3                         2941
#define DLEN                          2942
#define DLEN0                         2943
#define DLEN1                         2944
#define DLEN2                         2945
#define DLEN3                         2946
#define SCANLADRL                     2947
#define SCANLADRL_LADR                2948
#define SCANLADRL_SCANLADR            2949
#define LADR0                         2950
#define SCANLADR0                     2951
#define SCANLADR1                     2952
#define LADR1                         2953
#define LADR2                         2954
#define SCANLADR2                     2955
#define LADR3                         2956
#define SCANLADR3                     2957
#define LADR4                         2958
#define SCANLADR4                     2959
#define LADR5                         2960
#define SCANLADR5                     2961
#define SCANLADR6                     2962
#define LADR6                         2963
#define LADR7                         2964
#define SCANLADR7                     2965
#define SCANLADRH                     2966
#define LADR8                         2967
#define SCANLADRH_SCANLADR            2968
#define SCANLADR8                     2969
#define SCANLADRH_LADR                2970
#define LADR9                         2971
#define SCANLADR9                     2972
#define LADR10                        2973
#define SCANLADR10                    2974
#define SCANLADR11                    2975
#define LADR11                        2976
#define LADR12                        2977
#define SCANLADR12                    2978
#define LADR13                        2979
#define SCANLADR13                    2980
#define LADR14                        2981
#define SCANLADR14                    2982
#define LADR15                        2983
#define SCANLADR15                    2984
#define SCANLADRU                     2985
#define LADR16                        2986
#define SCANLADR16                    2987
#define SCANLADRU_SCANLADR            2988
#define SCANLADRU_LADR                2989
#define SCANLADR17                    2990
#define LADR17                        2991
#define LADR18                        2992
#define SCANLADR18                    2993
#define LADR19                        2994
#define SCANLADR19                    2995
#define SCANLADR20                    2996
#define LADR20                        2997
#define SCANLADR21                    2998
#define LADR21                        2999
#define SCANHADRL                     3000
#define SCANHADR0                     3001
#define HADR0                         3002
#define SCANHADRL_HADR                3003
#define SCANHADRL_SCANHADR            3004
#define SCANHADR1                     3005
#define HADR1                         3006
#define SCANHADR2                     3007
#define HADR2                         3008
#define SCANHADR3                     3009
#define HADR3                         3010
#define SCANHADR4                     3011
#define HADR4                         3012
#define SCANHADR5                     3013
#define HADR5                         3014
#define SCANHADR6                     3015
#define HADR6                         3016
#define SCANHADR7                     3017
#define HADR7                         3018
#define SCANHADRH                     3019
#define HADR8                         3020
#define SCANHADRH_SCANHADR            3021
#define SCANHADR8                     3022
#define SCANHADRH_HADR                3023
#define HADR9                         3024
#define SCANHADR9                     3025
#define HADR10                        3026
#define SCANHADR10                    3027
#define SCANHADR11                    3028
#define HADR11                        3029
#define HADR12                        3030
#define SCANHADR12                    3031
#define HADR13                        3032
#define SCANHADR13                    3033
#define HADR14                        3034
#define SCANHADR14                    3035
#define HADR15                        3036
#define SCANHADR15                    3037
#define SCANHADRU                     3038
#define SCANHADRU_SCANHADR            3039
#define SCANHADRU_HADR                3040
#define HADR16                        3041
#define SCANHADR16                    3042
#define SCANHADR17                    3043
#define HADR17                        3044
#define HADR18                        3045
#define SCANHADR18                    3046
#define HADR19                        3047
#define SCANHADR19                    3048
#define HADR20                        3049
#define SCANHADR20                    3050
#define SCANHADR21                    3051
#define HADR21                        3052
#define SCANCON0                      3053
#define SCANMODE0                     3054
#define SCANCON0_MODE                 3055
#define SCANCON0_MODE0                3056
#define SCANMODE                      3057
#define SCANMODE1                     3058
#define SCANCON0_MODE1                3059
#define INTM                          3060
#define SCANINTM                      3061
#define DABORT                        3062
#define SCANINVALID                   3063
#define INVALID                       3064
#define SCANCON0_BUSY                 3065
#define SCANBUSY                      3066
#define SCANCON0_GO                   3067
#define SCANGO                        3068
#define SCANCON0_EN                   3069
#define SCANEN                        3070
#define SCANTRIG                      3071
#define TSEL0                         3072
#define TSEL                          3073
#define SCANTSEL0                     3074
#define SCANTSEL                      3075
#define TSEL1                         3076
#define SCANTSEL1                     3077
#define TSEL2                         3078
#define SCANTSEL2                     3079
#define TSEL3                         3080
#define SCANTSEL3                     3081
#define MDCON0                        3082
#define MDBIT                         3083
#define BIT                           3084
#define OPOL                          3085
#define MDOPOL                        3086
#define MDOUT                         3087
#define MDCON0_OUT                    3088
#define MDEN                          3089
#define MDCON0_EN                     3090
#define MDCON1                        3091
#define MDCLSYNC                      3092
#define CLSYNC                        3093
#define MDCLPOL                       3094
#define CLPOL                         3095
#define CHSYNC                        3096
#define MDCHSYNC                      3097
#define MDCHPOL                       3098
#define CHPOL                         3099
#define MDSRC                         3100
#define SRCS0                         3101
#define MDSRCS                        3102
#define SRCS                          3103
#define MDSRCS0                       3104
#define SRCS1                         3105
#define MDSRCS1                       3106
#define SRCS2                         3107
#define MDSRCS2                       3108
#define SRCS3                         3109
#define MDSRCS3                       3110
#define MDCARL                        3111
#define CLS0                          3112
#define MDCLS                         3113
#define MDCLS0                        3114
#define CLS                           3115
#define CLS1                          3116
#define MDCLS1                        3117
#define CLS2                          3118
#define MDCLS2                        3119
#define MDCARH                        3120
#define CHS0                          3121
#define CHS                           3122
#define MDCHS                         3123
#define MDCHS0                        3124
#define CHS1                          3125
#define MDCHS1                        3126
#define CHS2                          3127
#define MDCHS2                        3128
#define ADACT0                        3129
#define ADACT                         3130
#define ADACT1                        3131
#define ADACT2                        3132
#define ADACT3                        3133
#define ADACT4                        3134
#define ADCLK                         3135
#define ADCS0                         3136
#define ADCLK_ADCS                    3137
#define ADCS1                         3138
#define ADCS2                         3139
#define ADCS3                         3140
#define ADCS4                         3141
#define ADCS5                         3142
#define ADREF                         3143
#define ADPREF                        3144
#define ADPREF0                       3145
#define ADPREF1                       3146
#define ADNREF                        3147
#define ADCON1                        3148
#define ADDSEN                        3149
#define NVCFG0                        3150
#define NVCFG1                        3151
#define PVCFG0                        3152
#define CHSN3                         3153
#define PVCFG1                        3154
#define VCFG11                        3155
#define ADGPOL                        3156
#define ADIPEN                        3157
#define ADPPOL                        3158
#define ADCON2                        3159
#define ADMD                          3160
#define ADMD0                         3161
#define ADMD1                         3162
#define ADMD2                         3163
#define ADACLR                        3164
#define ADCRS                         3165
#define ADCRS0                        3166
#define ADCRS1                        3167
#define ADCRS2                        3168
#define ADPSIS                        3169
#define ADCON3                        3170
#define ADTMD                         3171
#define ADTMD0                        3172
#define ADTMD1                        3173
#define ADTMD2                        3174
#define ADSOI                         3175
#define ADCALC                        3176
#define ADCALC0                       3177
#define ADCALC1                       3178
#define ADCALC2                       3179
#define ADACQ                         3180
#define ADACQ0                        3181
#define ADACQ1                        3182
#define ADACQ2                        3183
#define ADACQ3                        3184
#define ADACQ4                        3185
#define ADACQ5                        3186
#define ADACQ6                        3187
#define ADACQ7                        3188
#define ADCAP                         3189
#define ADCAP0                        3190
#define ADCAP1                        3191
#define ADCAP2                        3192
#define ADCAP3                        3193
#define ADCAP4                        3194
#define ADPRE0                        3195
#define ADPRE                         3196
#define ADPRE1                        3197
#define ADPRE2                        3198
#define ADPRE3                        3199
#define ADPRE4                        3200
#define ADPRE5                        3201
#define ADPRE6                        3202
#define ADPRE7                        3203
#define ADPCH                         3204
#define ADPCH0                        3205
#define ADPCH1                        3206
#define ADPCH2                        3207
#define ADPCH3                        3208
#define ADPCH4                        3209
#define ADPCH5                        3210
#define ADCON0                        3211
#define ADCON0_GO                     3212
#define DONE                          3213
#define GO_NOT_DONE                   3214
#define GO_nDONE                      3215
#define ADGO                          3216
#define GODONE                        3217
#define ADFM                          3218
#define ADFM0                         3219
#define ADCON0_ADCS                   3220
#define ADCONT                        3221
#define ADCAL                         3222
#define ADON                          3223
#define ADPREVL                       3224
#define ADPREV0                       3225
#define ADPREV1                       3226
#define ADPREV2                       3227
#define ADPREV3                       3228
#define ADPREV4                       3229
#define ADPREV5                       3230
#define ADPREV6                       3231
#define ADPREV7                       3232
#define ADPREVH                       3233
#define ADPREV8                       3234
#define ADPREV9                       3235
#define ADPREV10                      3236
#define ADPREV11                      3237
#define ADPREV12                      3238
#define ADPREV13                      3239
#define ADPREV14                      3240
#define ADPREV15                      3241
#define ADRESL                        3242
#define ADRES0                        3243
#define ADRES1                        3244
#define ADRES2                        3245
#define ADRES3                        3246
#define ADRES4                        3247
#define ADRES5                        3248
#define ADRES6                        3249
#define ADRES7                        3250
#define ADRESH                        3251
#define ADRES8                        3252
#define ADRES9                        3253
#define ADRES10                       3254
#define ADRES11                       3255
#define ADRES12                       3256
#define ADRES13                       3257
#define ADRES14                       3258
#define ADRES15                       3259
#define ADSTAT                        3260
#define ADSTAT0                       3261
#define ADSTAT1                       3262
#define ADSTAT2                       3263
#define ADMATH                        3264
#define ADLTHR                        3265
#define ADUTHR                        3266
#define ADAOV                         3267
#define ADRPT0                        3268
#define ADRPT                         3269
#define ADRPT1                        3270
#define ADRPT2                        3271
#define ADRPT3                        3272
#define ADRPT4                        3273
#define ADRPT5                        3274
#define ADRPT6                        3275
#define ADRPT7                        3276
#define ADCNT0                        3277
#define ADCNT                         3278
#define ADCNT1                        3279
#define ADCNT2                        3280
#define ADCNT3                        3281
#define ADCNT4                        3282
#define ADCNT5                        3283
#define ADCNT6                        3284
#define ADCNT7                        3285
#define ADSTPT0                       3286
#define ADSTPTL                       3287
#define ADSTPT1                       3288
#define ADSTPT2                       3289
#define ADSTPT3                       3290
#define ADSTPT4                       3291
#define ADSTPT5                       3292
#define ADSTPT6                       3293
#define ADSTPT7                       3294
#define ADSTPT8                       3295
#define ADSTPTH                       3296
#define ADSTPT9                       3297
#define ADSTPT10                      3298
#define ADSTPT11                      3299
#define ADSTPT12                      3300
#define ADSTPT13                      3301
#define ADSTPT14                      3302
#define ADSTPT15                      3303
#define ADLTH0                        3304
#define ADLTHL                        3305
#define ADLTH1                        3306
#define ADLTH2                        3307
#define ADLTH3                        3308
#define ADLTH4                        3309
#define ADLTH5                        3310
#define ADLTH6                        3311
#define ADLTH7                        3312
#define ADLTH8                        3313
#define ADLTHH                        3314
#define ADLTH9                        3315
#define ADLTH10                       3316
#define ADLTH11                       3317
#define ADLTH12                       3318
#define ADLTH13                       3319
#define ADLTH14                       3320
#define ADLTH15                       3321
#define ADUTH0                        3322
