tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k40_tdd.h
#define ADUTHL                        3323
#define ADUTH1                        3324
#define ADUTH2                        3325
#define ADUTH3                        3326
#define ADUTH4                        3327
#define ADUTH5                        3328
#define ADUTH6                        3329
#define ADUTH7                        3330
#define ADUTH8                        3331
#define ADUTHH                        3332
#define ADUTH9                        3333
#define ADUTH10                       3334
#define ADUTH11                       3335
#define ADUTH12                       3336
#define ADUTH13                       3337
#define ADUTH14                       3338
#define ADUTH15                       3339
#define ADERR0                        3340
#define ADERRL                        3341
#define ADERR1                        3342
#define ADERR2                        3343
#define ADERR3                        3344
#define ADERR4                        3345
#define ADERR5                        3346
#define ADERR6                        3347
#define ADERR7                        3348
#define ADERR8                        3349
#define ADERRH                        3350
#define ADERR9                        3351
#define ADERR10                       3352
#define ADERR11                       3353
#define ADERR12                       3354
#define ADERR13                       3355
#define ADERR14                       3356
#define ADERR15                       3357
#define ADACC0                        3358
#define ADACCL                        3359
#define ADACC1                        3360
#define ADACC2                        3361
#define ADACC3                        3362
#define ADACC4                        3363
#define ADACC5                        3364
#define ADACC6                        3365
#define ADACC7                        3366
#define ADACC8                        3367
#define ADACCH                        3368
#define ADACC9                        3369
#define ADACC10                       3370
#define ADACC11                       3371
#define ADACC12                       3372
#define ADACC13                       3373
#define ADACC14                       3374
#define ADACC15                       3375
#define ADFLTR0                       3376
#define ADFLTRL                       3377
#define ADFLTR1                       3378
#define ADFLTR2                       3379
#define ADFLTR3                       3380
#define ADFLTR4                       3381
#define ADFLTR5                       3382
#define ADFLTR6                       3383
#define ADFLTR7                       3384
#define ADFLTR8                       3385
#define ADFLTRH                       3386
#define ADFLTR9                       3387
#define ADFLTR10                      3388
#define ADFLTR11                      3389
#define ADFLTR12                      3390
#define ADFLTR13                      3391
#define ADFLTR14                      3392
#define ADFLTR15                      3393
#define NVMADRL                       3394
#define ADR0                          3395
#define ADR                           3396
#define NVMADR0                       3397
#define ADR1                          3398
#define NVMADR1                       3399
#define ADR2                          3400
#define NVMADR2                       3401
#define ADR3                          3402
#define NVMADR3                       3403
#define ADR4                          3404
#define NVMADR4                       3405
#define NVMADR5                       3406
#define ADR5                          3407
#define ADR6                          3408
#define NVMADR6                       3409
#define ADR7                          3410
#define NVMADR7                       3411
#define NVMADRH                       3412
#define ADRH                          3413
#define NVMADR8                       3414
#define ADR8                          3415
#define ADR9                          3416
#define NVMADR9                       3417
#define NVMDAT0                       3418
#define NVMDAT                        3419
#define NVMDAT1                       3420
#define NVMDAT2                       3421
#define NVMDAT3                       3422
#define NVMDAT4                       3423
#define NVMDAT5                       3424
#define NVMDAT6                       3425
#define NVMDAT7                       3426
#define NVMCON1                       3427
#define RD                            3428
#define WR                            3429
#define WREN                          3430
#define WRERR                         3431
#define FREE                          3432
#define NVMREG                        3433
#define NVMREG0                       3434
#define NVMREG1                       3435
#define NVMCON2                       3436
#define LATA                          3437
#define LATA0                         3438
#define LA0                           3439
#define LATA1                         3440
#define LA1                           3441
#define LATA2                         3442
#define LA2                           3443
#define LATA3                         3444
#define LA3                           3445
#define LATA4                         3446
#define LA4                           3447
#define LATA5                         3448
#define LA5                           3449
#define LATA6                         3450
#define LA6                           3451
#define LATA7                         3452
#define LA7                           3453
#define LATB                          3454
#define LB0                           3455
#define LATB0                         3456
#define LB1                           3457
#define LATB1                         3458
#define LB2                           3459
#define LATB2                         3460
#define LB3                           3461
#define LATB3                         3462
#define LB4                           3463
#define LATB4                         3464
#define LB5                           3465
#define LATB5                         3466
#define LB6                           3467
#define LATB6                         3468
#define LB7                           3469
#define LATB7                         3470
#define LATC                          3471
#define LATC0                         3472
#define LC0                           3473
#define LATC1                         3474
#define LC1                           3475
#define LATC2                         3476
#define LC2                           3477
#define LATC3                         3478
#define LC3                           3479
#define LATC4                         3480
#define LC4                           3481
#define LATC5                         3482
#define LC5                           3483
#define LATC6                         3484
#define LC6                           3485
#define LATC7                         3486
#define LC7                           3487
#define LATD                          3488
#define LATD0                         3489
#define LD0                           3490
#define LATD1                         3491
#define LD1                           3492
#define LATD2                         3493
#define LD2                           3494
#define LATD3                         3495
#define LD3                           3496
#define LATD4                         3497
#define LD4                           3498
#define LATD5                         3499
#define LD5                           3500
#define LATD6                         3501
#define LD6                           3502
#define LATD7                         3503
#define LD7                           3504
#define LATE                          3505
#define LATE0                         3506
#define LE0                           3507
#define LATE1                         3508
#define LE1                           3509
#define LATE2                         3510
#define LE2                           3511
#define LATE3                         3512
#define LE3                           3513
#define LATE4                         3514
#define LE4                           3515
#define LATE5                         3516
#define LE5                           3517
#define LATE6                         3518
#define LE6                           3519
#define LATE7                         3520
#define LE7                           3521
#define LATF                          3522
#define LATF0                         3523
#define LF0                           3524
#define LATF1                         3525
#define LF1                           3526
#define LF2                           3527
#define LATF2                         3528
#define LF3                           3529
#define LATF3                         3530
#define LF4                           3531
#define LATF4                         3532
#define LF5                           3533
#define LATF5                         3534
#define LF6                           3535
#define LATF6                         3536
#define LF7                           3537
#define LATF7                         3538
#define LATG                          3539
#define LATG0                         3540
#define LG0                           3541
#define LATG1                         3542
#define LG1                           3543
#define LATG2                         3544
#define LG2                           3545
#define LATG3                         3546
#define LG3                           3547
#define LATG4                         3548
#define LG4                           3549
#define LATG6                         3550
#define LATG7                         3551
#define LATH                          3552
#define LH0                           3553
#define LATH0                         3554
#define LH1                           3555
#define LATH1                         3556
#define LH2                           3557
#define LATH2                         3558
#define LH3                           3559
#define LATH3                         3560
#define LH4                           3561
#define LH5                           3562
#define LH6                           3563
#define LH7                           3564
#define TRISA                         3565
#define TRISA0                        3566
#define TRISA_RA0                     3567
#define TRISA1                        3568
#define TRISA_RA1                     3569
#define TRISA2                        3570
#define TRISA_RA2                     3571
#define TRISA3                        3572
#define TRISA_RA3                     3573
#define TRISA_RA4                     3574
#define TRISA4                        3575
#define TRISA_RA5                     3576
#define TRISA5                        3577
#define TRISA_RA6                     3578
#define TRISA6                        3579
#define TRISA_RA7                     3580
#define TRISA7                        3581
#define TRISB                         3582
#define TRISB_RB0                     3583
#define TRISB0                        3584
#define TRISB_RB1                     3585
#define TRISB1                        3586
#define TRISB_RB2                     3587
#define TRISB2                        3588
#define TRISB_RB3                     3589
#define TRISB3                        3590
#define TRISB_RB4                     3591
#define TRISB4                        3592
#define TRISB_RB5                     3593
#define TRISB5                        3594
#define TRISB_RB6                     3595
#define TRISB6                        3596
#define TRISB_RB7                     3597
#define TRISB7                        3598
#define TRISC                         3599
#define TRISC0                        3600
#define TRISC_RC0                     3601
#define TRISC1                        3602
#define TRISC_RC1                     3603
#define TRISC2                        3604
#define TRISC_RC2                     3605
#define TRISC3                        3606
#define TRISC_RC3                     3607
#define TRISC4                        3608
#define TRISC_RC4                     3609
#define TRISC5                        3610
#define TRISC_RC5                     3611
#define TRISC6                        3612
#define TRISC_RC6                     3613
#define TRISC7                        3614
#define TRISC_RC7                     3615
#define TRISD                         3616
#define TRISD_RD0                     3617
#define TRISD0                        3618
#define TRISD_RD1                     3619
#define TRISD1                        3620
#define TRISD_RD2                     3621
#define TRISD2                        3622
#define TRISD_RD3                     3623
#define TRISD3                        3624
#define TRISD_RD4                     3625
#define TRISD4                        3626
#define TRISD_RD5                     3627
#define TRISD5                        3628
#define TRISD_RD6                     3629
#define TRISD6                        3630
#define TRISD_RD7                     3631
#define TRISD7                        3632
#define TRISE                         3633
#define TRISE_RE0                     3634
#define TRISE0                        3635
#define TRISE1                        3636
#define TRISE_RE1                     3637
#define TRISE2                        3638
#define TRISE_RE2                     3639
#define TRISE_RE3                     3640
#define TRISE3                        3641
#define TRISE_RE4                     3642
#define TRISE4                        3643
#define TRISE_RE5                     3644
#define TRISE5                        3645
#define TRISE_RE6                     3646
#define TRISE6                        3647
#define TRISE_RE7                     3648
#define TRISE7                        3649
#define TRISF                         3650
#define TRISF0                        3651
#define TRISF_RF0                     3652
#define TRISF_RF1                     3653
#define TRISF1                        3654
#define TRISF_RF2                     3655
#define TRISF2                        3656
#define TRISF3                        3657
#define TRISF_RF3                     3658
#define TRISF_RF4                     3659
#define TRISF4                        3660
#define TRISF_RF5                     3661
#define TRISF5                        3662
#define TRISF_RF6                     3663
#define TRISF6                        3664
#define TRISF7                        3665
#define TRISF_RF7                     3666
#define TRISG                         3667
#define TRISG0                        3668
#define TRISG_RG0                     3669
#define TRISG1                        3670
#define TRISG_RG1                     3671
#define TRISG2                        3672
#define TRISG_RG2                     3673
#define TRISG3                        3674
#define TRISG_RG3                     3675
#define TRISG4                        3676
#define TRISG_RG4                     3677
#define TRISG_RG6                     3678
#define TRISG6                        3679
#define TRISG7                        3680
#define TRISG_RG7                     3681
#define TRISH                         3682
#define TRISH0                        3683
#define TRISH_RH0                     3684
#define TRISH1                        3685
#define TRISH_RH1                     3686
#define TRISH2                        3687
#define TRISH_RH2                     3688
#define TRISH3                        3689
#define TRISH_RH3                     3690
#define PORTA                         3691
#define ULPWUIN                       3692
#define PORTA_RA0                     3693
#define PORTA_RA1                     3694
#define PORTA_RA2                     3695
#define PORTA_RA3                     3696
#define PORTA_RA4                     3697
#define LVDIN                         3698
#define PORTA_RA5                     3699
#define PORTA_RA6                     3700
#define PORTA_RA7                     3701
#define PORTA_RJPU                    3702
#define PORTB                         3703
#define PORTB_RB0                     3704
#define PORTB_RB1                     3705
#define PORTB_RB2                     3706
#define CCP2_PA2                      3707
#define PORTB_RB3                     3708
#define PORTB_RB4                     3709
#define PORTB_RB5                     3710
#define PORTB_RB6                     3711
#define PORTB_RB7                     3712
#define PORTC                         3713
#define PORTC_RC0                     3714
#define PA2                           3715
#define PORTC_RC1                     3716
#define CCP2                          3717
#define PA1                           3718
#define PORTC_RC2                     3719
#define PORTC_RC3                     3720
#define PORTC_RC4                     3721
#define PORTC_RC5                     3722
#define PORTC_RC6                     3723
#define PORTC_RC7                     3724
#define PORTD                         3725
#define PORTD_RD0                     3726
#define PORTD_RD1                     3727
#define PORTD_RD2                     3728
#define PORTD_RD3                     3729
#define PORTD_RD4                     3730
#define PORTD_RD5                     3731
#define PORTD_RD6                     3732
#define PORTD_RD7                     3733
#define SS2                           3734
#define PORTE                         3735
#define PD2                           3736
#define RDE                           3737
#define PORTE_RE0                     3738
#define WRE                           3739
#define PORTE_RE1                     3740
#define PC2                           3741
#define PORTE_CS                      3742
#define CCP10                         3743
#define PB2                           3744
#define PORTE_RE2                     3745
#define CCP9E                         3746
#define PORTE_RE3                     3747
#define PC3E                          3748
#define PB3E                          3749
#define PORTE_RE4                     3750
#define CCP8E                         3751
#define CCP7E                         3752
#define PORTE_RE5                     3753
#define PC1E                          3754
#define CCP6E                         3755
#define PORTE_RE6                     3756
#define PB1E                          3757
#define CCP2E                         3758
#define PA2E                          3759
#define PORTE_RE7                     3760
#define PORTF                         3761
#define PORTF_RF0                     3762
#define PORTF_RF1                     3763
#define C2OUTF                        3764
#define PORTF_RF2                     3765
#define C1OUTF                        3766
#define PORTF_RF3                     3767
#define PORTF_RF4                     3768
#define PORTF_RF5                     3769
#define PORTF_RF6                     3770
#define PORTF_RF7                     3771
#define PORTG                         3772
#define PORTG_RG0                     3773
#define PORTG_RG1                     3774
#define C3OUTG                        3775
#define PORTG_RG2                     3776
#define PORTG_RG3                     3777
#define PORTG_RG4                     3778
#define RG5                           3779
#define PORTG_RJPU                    3780
#define PORTG_RG6                     3781
#define PORTG_RG7                     3782
#define PORTH                         3783
#define PORTH_RH0                     3784
#define PORTH_RH1                     3785
#define PORTH_RH2                     3786
#define PORTH_RH3                     3787
#define SSP1BUF                       3788
#define SSP1BUF_SSPBUF                3789
#define SSP1ADD                       3790
#define SSP1ADD_SSPADD                3791
#define SSP1ADD_MSK0                  3792
#define MSK01                         3793
#define SSP1ADD_MSK1                  3794
#define MSK11                         3795
#define SSP1ADD_MSK2                  3796
#define MSK21                         3797
#define MSK31                         3798
#define SSP1ADD_MSK3                  3799
#define SSP1ADD_MSK4                  3800
#define MSK41                         3801
#define MSK51                         3802
#define SSP1ADD_MSK5                  3803
#define SSP1ADD_MSK6                  3804
#define MSK61                         3805
#define MSK71                         3806
#define SSP1ADD_MSK7                  3807
#define SSP1MSK                       3808
#define SSP1MSK_MSK0                  3809
#define SSP1MSK_SSPMSK                3810
#define SSP1MSK_MSK1                  3811
#define SSP1MSK_MSK2                  3812
#define SSP1MSK_MSK3                  3813
#define SSP1MSK_MSK4                  3814
#define SSP1MSK_MSK5                  3815
#define SSP1MSK_MSK6                  3816
#define SSP1MSK_MSK7                  3817
#define SSP1STAT                      3818
#define BF1                           3819
#define SSP1STAT_BF                   3820
#define UA1                           3821
#define SSP1STAT_UA                   3822
#define SSP1STAT_R_NOT_W              3823
#define RW1                           3824
#define SSP1STAT_nW                   3825
#define RW                            3826
#define SSP1STAT_READ_WRITE           3827
#define SSP1STAT_nWRITE               3828
#define SSP1STAT_I2C_READ             3829
#define SSP1STAT_R_W                  3830
#define R                             3831
#define SSP1STAT_NOT_WRITE            3832
#define SSP1STAT_R_nW                 3833
#define SSP1STAT_S                    3834
#define START                         3835
#define START1                        3836
#define SSP1STAT_I2C_START            3837
#define STOP                          3838
#define SSP1STAT_P                    3839
#define STOP1                         3840
#define SSP1STAT_I2C_STOP             3841
#define SSP1STAT_D_NOT_A              3842
#define SSP1STAT_D_A                  3843
#define SSP1STAT_D_nA                 3844
#define SSP1STAT_NOT_ADDRESS          3845
#define SSP1STAT_DATA_ADDRESS         3846
#define SSP1STAT_nA                   3847
#define D                             3848
#define DA1                           3849
#define DA                            3850
#define SSP1STAT_nADDRESS             3851
#define SSP1STAT_I2C_DAT              3852
#define SSP1STAT_CKE                  3853
#define CKE1                          3854
#define SSP1STAT_SMP                  3855
#define SMP1                          3856
#define SSP1CON1                      3857
#define SSP1CON1_SSPM0                3858
#define SSPM01                        3859
#define SSP1CON1_SSPM                 3860
#define SSP1CON1_SSPM1                3861
#define SSPM11                        3862
#define SSP1CON1_SSPM2                3863
#define SSPM21                        3864
#define SSPM31                        3865
#define SSP1CON1_SSPM3                3866
#define SSP1CON1_CKP                  3867
#define CKP1                          3868
#define SSPEN1                        3869
#define SSP1CON1_SSPEN                3870
#define SSPOV1                        3871
#define SSP1CON1_SSPOV                3872
#define WCOL1                         3873
#define SSP1CON1_WCOL                 3874
#define SSP1CON2                      3875
#define SEN1                          3876
#define SSP1CON2_SEN                  3877
#define ADMSK11                       3878
#define SSP1CON2_RSEN                 3879
#define RSEN1                         3880
