tiborsimon/embedded-tdd-headers/pic/8bit/pic18f66k40_tdd.h
#define T3GSS0                        4439
#define T3GATE_GSS0                   4440
#define T3GATE_GSS                    4441
#define T3GSS1                        4442
#define T3GATE_GSS1                   4443
#define T3GSS2                        4444
#define T3GATE_GSS2                   4445
#define T3GSS3                        4446
#define T3GATE_GSS3                   4447
#define T3CLK                         4448
#define T3CLK_CS                      4449
#define T3CLK_CS0                     4450
#define T3CS0                         4451
#define T3CLK_CS1                     4452
#define T3CS1                         4453
#define T3CLK_CS2                     4454
#define T3CS2                         4455
#define T3CS3                         4456
#define T3CLK_CS3                     4457
#define TMR1L                         4458
#define TMR1L0                        4459
#define TMR1L1                        4460
#define TMR1L2                        4461
#define TMR1L3                        4462
#define TMR1L4                        4463
#define TMR1L5                        4464
#define TMR1L6                        4465
#define TMR1L7                        4466
#define TMR1H0                        4467
#define TMR1H                         4468
#define TMR1H1                        4469
#define TMR1H2                        4470
#define TMR1H3                        4471
#define TMR1H4                        4472
#define TMR1H5                        4473
#define TMR1H6                        4474
#define TMR1H7                        4475
#define T1CON                         4476
#define TMR1ON                        4477
#define T1CON_ON                      4478
#define T1CON_RD16                    4479
#define T1RD16                        4480
#define NOT_T1SYNC                    4481
#define T1CON_nSYNC                   4482
#define nT1SYNC                       4483
#define T1CON_NOT_SYNC                4484
#define T1CON_CKPS0                   4485
#define T1CKPS0                       4486
#define T1CON_CKPS                    4487
#define T1CKPS1                       4488
#define T1CON_CKPS1                   4489
#define T1GCON                        4490
#define T1GCON_GVAL                   4491
#define T1GVAL                        4492
#define T1GGO_NOT_DONE                4493
#define T1GGO_nDONE                   4494
#define T1GCON_GGO_nDONE              4495
#define T1GCON_GGO_NOT_DONE           4496
#define T1GGO                         4497
#define T1GCON_GSPM                   4498
#define T1GSPM                        4499
#define T1GTM                         4500
#define T1GCON_GTM                    4501
#define T1GPOL                        4502
#define T1GCON_GPOL                   4503
#define T1GCON_GE                     4504
#define T1GE                          4505
#define T1GATE                        4506
#define T1GATE_GSS0                   4507
#define T1GSS0                        4508
#define T1GATE_GSS                    4509
#define T1GATE_GSS1                   4510
#define T1GSS1                        4511
#define T1GSS2                        4512
#define T1GATE_GSS2                   4513
#define T1GSS3                        4514
#define T1GATE_GSS3                   4515
#define T1CLK                         4516
#define T1CS0                         4517
#define T1CLK_CS                      4518
#define T1CLK_CS0                     4519
#define T1CLK_CS1                     4520
#define T1CS1                         4521
#define T1CS2                         4522
#define T1CLK_CS2                     4523
#define T1CS3                         4524
#define T1CLK_CS3                     4525
#define TMR0L0                        4526
#define TMR0L                         4527
#define TMR0L1                        4528
#define TMR0L2                        4529
#define TMR0L3                        4530
#define TMR0L4                        4531
#define TMR0L5                        4532
#define TMR0L6                        4533
#define TMR0L7                        4534
#define TMR0H0                        4535
#define T0PR                          4536
#define TMR0H                         4537
#define T0PR0                         4538
#define TMR0H1                        4539
#define T0PR1                         4540
#define TMR0H2                        4541
#define T0PR2                         4542
#define TMR0H3                        4543
#define T0PR3                         4544
#define TMR0H4                        4545
#define T0PR4                         4546
#define TMR0H5                        4547
#define T0PR5                         4548
#define TMR0H6                        4549
#define T0PR6                         4550
#define TMR0H7                        4551
#define T0PR7                         4552
#define T0CON0                        4553
#define T0OUTPS                       4554
#define T0OUTPS0                      4555
#define T0OUTPS1                      4556
#define T0OUTPS2                      4557
#define T0OUTPS3                      4558
#define T016BIT                       4559
#define T0OUT                         4560
#define T0EN                          4561
#define T0CON1                        4562
#define T0PS                          4563
#define T0CKPS                        4564
#define T0CKPS0                       4565
#define T0PS0                         4566
#define T0CKPS1                       4567
#define T0PS1                         4568
#define T0CKPS2                       4569
#define T0PS2                         4570
#define T0CKPS3                       4571
#define T0PS3                         4572
#define T0ASYNC                       4573
#define T0CS                          4574
#define T0CS0                         4575
#define T0CS1                         4576
#define T0CS2                         4577
#define PCON0                         4578
#define BOR                           4579
#define NOT_BOR                       4580
#define nBOR                          4581
#define POR                           4582
#define nPOR                          4583
#define NOT_POR                       4584
#define nRI                           4585
#define NOT_RI                        4586
#define RI                            4587
#define NOT_RMCLR                     4588
#define nRMCLR                        4589
#define RMCLR                         4590
#define NOT_RWDT                      4591
#define nRWDT                         4592
#define RWDT                          4593
#define nWDTWV                        4594
#define WDTWV                         4595
#define NOT_WDTWV                     4596
#define STKUNF                        4597
#define STKOVF                        4598
#define STATUS                        4599
#define C                             4600
#define CARRY                         4601
#define STATUS_DC                     4602
#define ZERO                          4603
#define Z                             4604
#define OV                            4605
#define OVERFLOW                      4606
#define N                             4607
#define NEGATIVE                      4608
#define PD                            4609
#define nPD                           4610
#define NOT_PD                        4611
#define TO                            4612
#define NOT_TO                        4613
#define nTO                           4614
#define FSR2L                         4615
#define PLUSW2                        4616
#define PREINC2                       4617
#define POSTDEC2                      4618
#define POSTINC2                      4619
#define INDF2                         4620
#define FSR1L                         4621
#define PLUSW1                        4622
#define PREINC1                       4623
#define POSTDEC1                      4624
#define POSTINC1                      4625
#define INDF1                         4626
#define WREG                          4627
#define FSR0L                         4628
#define PLUSW0                        4629
#define PREINC0                       4630
#define POSTDEC0                      4631
#define POSTINC0                      4632
#define INDF0                         4633
#define INTCON                        4634
#define INT0EDG                       4635
#define INT1EDG                       4636
#define INT2EDG                       4637
#define INT3EDG                       4638
#define IPEN                          4639
#define PEIE                          4640
#define PEIE_GIEL                     4641
#define GIEL                          4642
#define GIE                           4643
#define GIE_GIEH                      4644
#define GIEH                          4645
#define PRODL                         4646
#define PRODH                         4647
#define TABLAT                        4648
#define TBLPTRL                       4649
#define TBLPTRH                       4650
#define TBLPTRU                       4651
#define ACSS                          4652
#define PCL                           4653
#define PCLATH                        4654
#define PCLATH_PCH                    4655
#define PCLATU                        4656
#define PCU                           4657
#define STKPTR0                       4658
#define STKPTR                        4659
#define SP0                           4660
#define STKPTR1                       4661
#define SP1                           4662
#define STKPTR2                       4663
#define SP2                           4664
#define SP3                           4665
#define STKPTR3                       4666
#define STKPTR4                       4667
#define SP4                           4668
#define STKPTR5                       4669
#define SP5                           4670
#define TOSL                          4671
#define TOSH                          4672

#endif // _PIC18F66K40_H_
